Revit 2026 API

# LinkedResourceOpenedEventArgs Class

---

The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpened].

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPostEventArgs Autodesk.Revit.DB.EventsRevitAPIPostDocEventArgs Autodesk.Revit.DB.EventsLinkedResourceOpenedEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinkedResourceOpenedEventArgs : RevitAPIPostDocEventArgs
```
```vb
Public Class LinkedResourceOpenedEventArgs
	Inherits RevitAPIPostDocEventArgs
```
```cpp
public ref class LinkedResourceOpenedEventArgs : public RevitAPIPostDocEventArgs
```
```fsharp
type LinkedResourceOpenedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
```

The LinkedResourceOpenedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPostDocEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | LinkedResourcePathName | Path of the linked resource. |
|  | ResourceType | The desired linked resource type. |
|  | ResourceTypeId | Element id of the linked resource. |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace